
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтрокаПодключения = "Driver={SQL Server};Server=localhost\SQLEXPRESS;UID=sa;Pwd=UserPassword;Database=Pubs";
	ТекстЗапроса =
	"SELECT TOP 100
	|	*
	|FROM
	|	[pubs].[dbo].[authors]";
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	Если ПустаяСтрока(СтрокаПодключения) Или ПустаяСтрока(ТекстЗапроса) Тогда
		Сообщить(НСтр("ru='Необходимо заполнить строку подключения и текст запроса!'"));
		Возврат;
	КонецЕсли;
	ВыполнитьЗапросНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	
	ТаблицаРезультата = Новый ТаблицаЗначений();
	
	Подключение = Неопределено;
	Если Не Подключиться(Подключение, СтрокаПодключения) Тогда
		Возврат;
	КонецЕсли;
	
	КурсорЗаписей = Неопределено;
	Если ВыполнитьЗапросКБазе(ТекстЗапроса, КурсорЗаписей, Подключение)=1 Тогда
		Для Каждого Колонка Из КурсорЗаписей.Fields Цикл
			ТаблицаРезультата.Колонки.Добавить(Колонка.Name);
		КонецЦикла;
		Пока Не КурсорЗаписей.EOF Цикл
			НоваяСтрока = ТаблицаРезультата.Добавить();
			Для Каждого Колонка Из КурсорЗаписей.Fields Цикл
				ИмяКолонки = Колонка.Name;
				НоваяСтрока[ИмяКолонки] = Колонка.Value;
			КонецЦикла; 
			КурсорЗаписей.MoveNext();
		КонецЦикла;
		КурсорЗаписей.Close();
	КонецЕсли;
		
	Отключиться(Подключение);
	
	РезультатЗапроса.Очистить();
	ЗаголовкиКолонок = ВывестиЗаголовкиКолонок(ТаблицаРезультата);
	РезультатЗапроса.Вывести(ЗаголовкиКолонок);
	Детали = ВывестиДетали(ТаблицаРезультата);
	РезультатЗапроса.Вывести(Детали);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Подключиться(Connection, Знач ConnectionString)
	
	Попытка
		Connection = Новый COMОбъект("ADODB.Connection");
		Connection.ConnectionTimeout = 10;
		Connection.Open(ConnectionString);
	Исключение
		Сообщить("Не удалось подключиться к базе. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура Отключиться(Подключение)
	
	Попытка
		Подключение.Close();
	Исключение
		Сообщить("Ошибка при закрытии соединения. " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьЗапросКБазе(Знач QueryText, RecordSet, Connection)
	
	Попытка
		RecordSet = Новый COMОбъект("ADODB.RecordSet");
		Command = Новый COMОбъект("ADODB.Command");
		Command.ActiveConnection		= Connection;
		Command.CommandText			= QueryText;
		RecordSet = Command.Execute();
	Исключение
		Сообщить("Ошибка при выполнении запроса к базе. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ВывестиЗаголовкиКолонок(ТаблицаРезультата)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	МакетВывода = ОбъектОбработки.ПолучитьМакет("РезультатЗапроса");
	ОбластьЗаголовкиКолонок 	= МакетВывода.ПолучитьОбласть("ОбластьЯчейки");
	
	Область = ОбластьЗаголовкиКолонок.Область();
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Область.ЦветФона = Новый Цвет(204, 192, 133);
	
	ЗаголовокКолонок	 = Новый ТабличныйДокумент;
	Индекс = 0;
	Для каждого Стр Из ТаблицаРезультата.Колонки Цикл
		ОбластьЗаголовкиКолонок.Параметры.Значение	= Стр.Имя;
		ЗаголовокКолонок.Присоединить(ОбластьЗаголовкиКолонок);
		Индекс	= Индекс + 1;
	КонецЦикла;
	Возврат ЗаголовокКолонок;
	
КонецФункции

&НаСервере
Функция ВывестиДетали(ТаблицаРезультата)
	
	ОбщиеДетали = Новый ТабличныйДокумент;
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	МакетВывода = ОбъектОбработки.ПолучитьМакет("РезультатЗапроса");
	КоличествоКолонок = ТаблицаРезультата.Колонки.Количество();
	КоличествоСтрокРезультатаЗапроса	= ТаблицаРезультата.Количество();
	ИндексСтроки = 1;
	Для каждого Строка Из ТаблицаРезультата Цикл
		Если ИндексСтроки > КоличествоСтрокРезультатаЗапроса Тогда
			Прервать;
		КонецЕсли;
		Детали = Новый ТабличныйДокумент;
		ОбластьДетали = МакетВывода.ПолучитьОбласть("ОбластьЯчейки");
		Для Индекс = 0 По КоличествоКолонок - 1 Цикл
			Значение = Строка.Получить(Индекс);
			ОбластьДетали.Параметры.Значение = Значение;
			Детали.Присоединить(ОбластьДетали);
		КонецЦикла;
		ИндексСтроки = ИндексСтроки + 1;
		ОбщиеДетали.Вывести(Детали);
	КонецЦикла;
		
	Возврат ОбщиеДетали;
	
КонецФункции
